[
  {
    "name": "งานเตรียมงาน - บ้าน 2 ชั้น",
    "description": "Checklist สำหรับงานเตรียมพื้นที่ก่อนเริ่มก่อสร้างบ้าน 2 ชั้น",
    "category": "งานเตรียมงาน",
    "items": [
      {
        "title": "การสำรวจและเตรียมพื้นที่",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบเอกสารสิทธิ์ที่ดินและใบอนุญาตก่อสร้าง",
          "สำรวจแนวเขตที่ดินและปักหลักแนวเขต",
          "ตรวจสอบระดับพื้นที่และทำแผนผังการก่อสร้าง",
          "ตรวจสอบแหล่งน้ำและระบบระบายน้ำในพื้นที่",
          "วางแผนเส้นทางขนส่งวัสดุและเครื่องจักร"
        ]
      },
      {
        "title": "การเตรียมพื้นที่ก่อสร้าง",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ถางป่าและเคลียร์พื้นที่ตามแบบก่อสร้าง",
          "ปรับระดับพื้นที่ให้เหมาะสม",
          "ตรวจสอบความแข็งแรงของดิน (Soil Test)",
          "ขุดดินและเตรียมพื้นที่สำหรับฐานราก",
          "จัดทำถนนชั่วคราวสำหรับขนส่งวัสดุ"
        ]
      },
      {
        "title": "การตรวจสอบหลังเสร็จงาน",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบระดับพื้นที่ตรงตามแบบ",
          "ตรวจสอบความพร้อมของพื้นที่สำหรับงานโครงสร้าง",
          "จัดเก็บเอกสารผลการทดสอบดิน",
          "ตรวจสอบระบบระบายน้ำชั่วคราว",
          "ถ่ายภาพบันทึกสภาพพื้นที่ก่อนเริ่มก่อสร้าง"
        ]
      },
      {
        "title": "ระบบสาธารณูปโภคชั่วคราว",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "จัดหาแหล่งน้ำสำหรับงานก่อสร้าง",
          "ติดตั้งระบบไฟฟ้าชั่วคราว",
          "จัดทำห้องน้ำชั่วคราวสำหรับคนงาน",
          "จัดพื้นที่เก็บวัสดุก่อสร้าง",
          "ติดตั้งป้ายโครงการและป้ายเตือนความปลอดภัย"
        ]
      }
    ]
  },
  {
    "name": "งานโครงสร้าง - บ้าน 2 ชั้น",
    "description": "Checklist สำหรับงานโครงสร้างคอนกรีตเสริมเหล็กบ้าน 2 ชั้น",
    "category": "งานโครงสร้าง",
    "items": [
      {
        "title": "งานฐานราก",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบฐานรากและรายละเอียดเหล็กเสริม",
          "ตรวจสอบความลึกของหลุมฐานรากตามแบบ",
          "ตรวจสอบคุณภาพดินก้นหลุมฐานราก",
          "เตรียมวัสดุ: คอนกรีต เหล็กเสริม แบบหล่อ",
          "ตรวจสอบตำแหน่งฐานรากตรงตามแบบ"
        ]
      },
      {
        "title": "งานฐานราก",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการผูกเหล็กเสริมตามแบบ (ขนาด ระยะห่าง)",
          "ตรวจสอบความหนาของคอนกรีตรองพื้น (Lean Concrete)",
          "ตรวจสอบตำแหน่งและความตรงของเหล็กเสริม",
          "ตรวจสอบ Slump Test ของคอนกรีต",
          "ตรวจสอบการเทคอนกรีตและการบ่มคอนกรีต"
        ]
      },
      {
        "title": "งานฐานราก",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบความแข็งแรงของคอนกรีต (Curing 7-28 วัน)",
          "ตรวจสอบระดับและความเรียบของฐานราก",
          "ตรวจสอบการถอดแบบและทำความสะอาด",
          "ถ่ายภาพบันทึกงานฐานรากก่อนถมดิน",
          "จัดเก็บ Cylinder Test ของคอนกรีต"
        ]
      },
      {
        "title": "งานเสา คาน พื้น ชั้น 1",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบโครงสร้างเสา คาน พื้นชั้น 1",
          "ตรวจสอบรายการเหล็กเสริมและขนาดตามแบบ",
          "เตรียมแบบหล่อและค้ำยันให้พร้อม",
          "ตรวจสอบตำแหน่งเสาตรงตามแบบ",
          "เตรียมอุปกรณ์ปั๊มคอนกรีต"
        ]
      },
      {
        "title": "งานเสา คาน พื้น ชั้น 1",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการผูกเหล็กเสริมเสา (Main bar, Tie)",
          "ตรวจสอบการผูกเหล็กเสริมคาน (Top bar, Bottom bar, Stirrup)",
          "ตรวจสอบความหนาของ Concrete Cover",
          "ตรวจสอบความแข็งแรงของแบบหล่อและค้ำยัน",
          "ตรวจสอบการเทคอนกรีตและการเสียบไม้",
          "ตรวจสอบ Slump Test และ Cylinder Test"
        ]
      },
      {
        "title": "งานเสา คาน พื้น ชั้น 1",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบการบ่มคอนกรีต (7-28 วัน)",
          "ตรวจสอบความเรียบและระดับของพื้น",
          "ตรวจสอบรอยแตกหรือตำหนิของคอนกรีต",
          "ตรวจสอบการถอดแบบและทำความสะอาด",
          "วัดขนาดและตำแหน่งเสาตรงตามแบบ",
          "ถ่ายภาพบันทึกงานโครงสร้างชั้น 1"
        ]
      },
      {
        "title": "งานเสา คาน พื้น ชั้น 2",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบโครงสร้างเสา คาน พื้นชั้น 2",
          "ตรวจสอบความแข็งแรงของพื้นชั้น 1 ก่อนทำงาน",
          "เตรียมแบบหล่อและค้ำยันชั้น 2",
          "ตรวจสอบเหล็กเสริมต่อจากชั้น 1",
          "วางแผนการขนวัสดุขึ้นชั้น 2"
        ]
      },
      {
        "title": "งานเสา คาน พื้น ชั้น 2",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการต่อเหล็กเสริมจากชั้น 1",
          "ตรวจสอบการผูกเหล็กเสริมเสา คาน ชั้น 2",
          "ตรวจสอบความแข็งแรงของค้ำยันชั้น 2",
          "ตรวจสอบท่อร้อยสายไฟและท่อประปาในพื้น",
          "ตรวจสอบการเทคอนกรีตและ Slump Test"
        ]
      },
      {
        "title": "งานเสา คาน พื้น ชั้น 2",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบการบ่มคอนกรีตชั้น 2",
          "ตรวจสอบความเรียบและระดับของพื้นชั้น 2",
          "ตรวจสอบรอยแตกหรือตำหนิ",
          "วัดความสูงของชั้น 2 ตรงตามแบบ",
          "ถ่ายภาพบันทึกงานโครงสร้างชั้น 2"
        ]
      },
      {
        "title": "งานหลังคา",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบโครงสร้างหลังคา",
          "เตรียมวัสดุ: โครงเหล็ก/ไม้ กระเบื้อง",
          "ตรวจสอบอุปกรณ์ความปลอดภัยสำหรับงานบนที่สูง",
          "วางแผนการติดตั้งโครงหลังคา",
          "ตรวจสอบความพร้อมของคาน Ring Beam"
        ]
      },
      {
        "title": "งานหลังคา",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการติดตั้งโครงหลังคาตามแบบ",
          "ตรวจสอบความแข็งแรงของโครงหลังคา",
          "ตรวจสอบมุมเอียงของหลังคา",
          "ตรวจสอบการติดตั้งแผ่นกันซึม",
          "ตรวจสอบการติดตั้งกระเบื้องหรือแผ่นหลังคา"
        ]
      },
      {
        "title": "งานหลังคา",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบความมิดชิดของหลังคา",
          "ทดสอบการไหลของน้ำฝนในรางน้ำ",
          "ตรวจสอบการติดตั้งครอบสันหลังคา",
          "ตรวจสอบการติดตั้งบันไดขึ้นหลังคา (ถ้ามี)",
          "ถ่ายภาพบันทึกงานหลังคา"
        ]
      }
    ]
  },
  {
    "name": "งานสถาปัตยกรรม - บ้าน 2 ชั้น",
    "description": "Checklist สำหรับงานสถาปัตยกรรมและตกแต่งบ้าน 2 ชั้น",
    "category": "งานสถาปัตยกรรม",
    "items": [
      {
        "title": "งานก่ออิฐผนัง",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบผังผนังและตำแหน่งประตู-หน้าต่าง",
          "เตรียมวัสดุ: อิฐมอญ/บล็อก ปูนซีเมนต์ ทราย",
          "ตรวจสอบคุณภาพอิฐ (ขนาด ความแข็ง)",
          "เตรียมเส้นแนวและระดับสำหรับก่ออิฐ",
          "ตรวจสอบตำแหน่งท่อร้อยสายไฟและประปา"
        ]
      },
      {
        "title": "งานก่ออิฐผนัง",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบความตรงและระดับของผนัง",
          "ตรวจสอบความหนาของผนังตามแบบ",
          "ตรวจสอบการเชื่อมผนังเข้ากับเสา",
          "ตรวจสอบขนาดช่องประตู-หน้าต่างตามแบบ",
          "ตรวจสอบการติดตั้งคานทับหลังประตู-หน้าต่าง"
        ]
      },
      {
        "title": "งานก่ออิฐผนัง",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบความเรียบและความตรงของผนัง",
          "ตรวจสอบรอยร้าวหรือตำหนิ",
          "วัดขนาดห้องและช่องประตู-หน้าต่าง",
          "ตรวจสอบการทำความสะอาดผนัง",
          "ถ่ายภาพบันทึกงานก่ออิฐ"
        ]
      },
      {
        "title": "งานฉาบปูน",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบความพร้อมของผนังก่ออิฐ",
          "เตรียมวัสดุ: ปูนซีเมนต์ ทราย น้ำ",
          "ตรวจสอบสัดส่วนผสมปูนฉาบ",
          "เตรียมเครื่องมือและนั่งร้าน",
          "ตรวจสอบการปิดท่อและช่องต่างๆ"
        ]
      },
      {
        "title": "งานฉาบปูน",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบความหนาของปูนฉาบ (15-20 มม.)",
          "ตรวจสอบความเรียบและความตรงของผิวปูน",
          "ตรวจสอบมุมฉากของมุมผนัง",
          "ตรวจสอบการฉาบปูนรอบช่องประตู-หน้าต่าง",
          "ตรวจสอบการบ่มปูนด้วยน้ำ"
        ]
      },
      {
        "title": "งานฉาบปูน",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบความเรียบของผิวปูน",
          "ตรวจสอบรอยแตกหรือผิวปูนลอก",
          "วัดความหนาของปูนฉาบ",
          "ตรวจสอบความสะอาดของพื้นผิว",
          "ถ่ายภาพบันทึกงานฉาบปูน"
        ]
      },
      {
        "title": "งานติดตั้งประตู-หน้าต่าง",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบขนาดช่องประตู-หน้าต่างตรงตามแบบ",
          "ตรวจสอบคุณภาพวงกบและบานประตู-หน้าต่าง",
          "เตรียมอุปกรณ์: บานพับ มือจับ กลอน",
          "ตรวจสอบความเรียบของช่องติดตั้ง",
          "เตรียมเครื่องมือสำหรับติดตั้ง"
        ]
      },
      {
        "title": "งานติดตั้งประตู-หน้าต่าง",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบความตรงและระดับของวงกบ",
          "ตรวจสอบการยึดวงกบเข้ากับผนัง",
          "ตรวจสอบการติดตั้งบานพับและมือจับ",
          "ทดสอบการเปิด-ปิดประตู-หน้าต่าง",
          "ตรวจสอบช่องว่างรอบวงกบ"
        ]
      },
      {
        "title": "งานติดตั้งประตู-หน้าต่าง",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ทดสอบการทำงานของประตู-หน้าต่างทั้งหมด",
          "ตรวจสอบการปิดมิดชิด",
          "ตรวจสอบอุปกรณ์ล็อคและกลอน",
          "ตรวจสอบการติดตั้งมุ้งลวด (ถ้ามี)",
          "ถ่ายภาพบันทึกงานติดตั้ง"
        ]
      },
      {
        "title": "งานปูกระเบื้อง",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบผังการปูกระเบื้อง",
          "ตรวจสอบคุณภาพและขนาดกระเบื้อง",
          "ตรวจสอบความเรียบของพื้นผิว",
          "เตรียมวัสดุ: กาวยาแนว ยาแนว",
          "วางแผนการปูเริ่มต้นจากจุดใด"
        ]
      },
      {
        "title": "งานปูกระเบื้อง",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบระดับและความเรียบของกระเบื้อง",
          "ตรวจสอบระยะช่องยาแนวสม่ำเสมอ",
          "ตรวจสอบลวดลายและทิศทางการปู",
          "ตรวจสอบการปูกระเบื้องรอบท่อและอุปกรณ์",
          "ตรวจสอบการตัดกระเบื้องให้เรียบร้อย"
        ]
      },
      {
        "title": "งานปูกระเบื้อง",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบความเรียบและระดับของพื้นกระเบื้อง",
          "ตรวจสอบการอุดยาแนวเรียบร้อย",
          "ตรวจสอบกระเบื้องแตกหรือร้าว",
          "ทำความสะอาดคราบกาวและยาแนว",
          "ถ่ายภาพบันทึกงานปูกระเบื้อง"
        ]
      },
      {
        "title": "งานทาสี",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบความพร้อมของผิวผนังและเพดาน",
          "เตรียมวัสดุ: สีรองพื้น สีทาผนัง",
          "ตรวจสอบสีตัวอย่างและรหัสสี",
          "เตรียมอุปกรณ์: แปรง โรลเลอร์ สเปรย์",
          "ปิดคลุมพื้นและอุปกรณ์"
        ]
      },
      {
        "title": "งานทาสี",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการทาสีรองพื้นครบทุกจุด",
          "ตรวจสอบจำนวนชั้นของสีตามแบบ",
          "ตรวจสอบสีทาสม่ำเสมอไม่มีรอยแปรง",
          "ตรวจสอบการทาสีขอบและมุมผนัง",
          "ตรวจสอบการปกป้องพื้นผิวอื่นจากสี"
        ]
      },
      {
        "title": "งานทาสี",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ตรวจสอบสีทาสม่ำเสมอทั่วทั้งผนัง",
          "ตรวจสอบสีตรงตามตัวอย่างที่เลือก",
          "ตรวจสอบคราบสีบนพื้นและอุปกรณ์",
          "ทำความสะอาดพื้นที่ทำงาน",
          "ถ่ายภาพบันทึกงานทาสี"
        ]
      }
    ]
  },
  {
    "name": "งานระบบ (MEP) - บ้าน 2 ชั้น",
    "description": "Checklist สำหรับงานระบบไฟฟ้า ประปา และสุขาภิบาลบ้าน 2 ชั้น",
    "category": "งานระบบ",
    "items": [
      {
        "title": "งานระบบไฟฟ้า - เตรียมงาน",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบไฟฟ้าและตำแหน่งอุปกรณ์",
          "เตรียมวัสดุ: สายไฟ ท่อร้อย สวิตช์ ปลั๊ก",
          "ตรวจสอบขนาดสายไฟตามโหลดการใช้งาน",
          "วางแผนเส้นทางท่อร้อยสายไฟ",
          "ตรวจสอบตำแหน่งตู้เมนและตู้ย่อย"
        ]
      },
      {
        "title": "งานระบบไฟฟ้า - ร้อยท่อ",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการร้อยท่อในพื้นและผนังก่อนเทคอนกรีต",
          "ตรวจสอบความลึกและตำแหน่งของท่อ",
          "ตรวจสอบการปิดปลายท่อป้องกันคอนกรีตเข้า",
          "ตรวจสอบการดึงลวดดึงสายไฟ",
          "ถ่ายภาพบันทึกเส้นทางท่อก่อนปิดผนัง"
        ]
      },
      {
        "title": "งานระบบไฟฟ้า - เดินสายไฟ",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบขนาดและสีของสายไฟตรงตามแบบ",
          "ตรวจสอบการเดินสายไฟในท่อไม่ติดขัด",
          "ตรวจสอบการต่อสายไฟในกล่องต่อ",
          "ตรวจสอบการต่อสายดิน (Ground)",
          "ทดสอบความต่อเนื่องของสายไฟ (Continuity Test)"
        ]
      },
      {
        "title": "งานระบบไฟฟ้า - ติดตั้งอุปกรณ์",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการติดตั้งตู้เมนและเบรกเกอร์",
          "ตรวจสอบการติดตั้งสวิตช์และปลั๊กตรงตามแบบ",
          "ตรวจสอบความสูงของสวิตช์และปลั๊ก",
          "ตรวจสอบการติดตั้งโคมไฟและพัดลม",
          "ตรวจสอบการต่อสายดินทุกจุด"
        ]
      },
      {
        "title": "งานระบบไฟฟ้า - ทดสอบระบบ",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ทดสอบการทำงานของเบรกเกอร์ทุกตัว",
          "ทดสอบแรงดันไฟฟ้าที่ปลั๊กทุกจุด (220V)",
          "ทดสอบการทำงานของสวิตช์และโคมไฟทั้งหมด",
          "ทดสอบ Insulation Resistance",
          "ทดสอบ Earth Leakage Circuit Breaker (ELCB)",
          "จัดทำเอกสารผลการทดสอบและแผนผังไฟฟ้า As-Built"
        ]
      },
      {
        "title": "งานระบบประปา - เตรียมงาน",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบประปาและตำแหน่งอุปกรณ์",
          "เตรียมวัสดุ: ท่อ PVC ข้อต่อ วาล์ว",
          "ตรวจสอบขนาดท่อตามการใช้งาน",
          "วางแผนเส้นทางท่อประปา",
          "ตรวจสอบตำแหน่งแท้งค์น้ำและปั๊มน้ำ"
        ]
      },
      {
        "title": "งานระบบประปา - ติดตั้งท่อ",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการติดตั้งท่อในพื้นและผนัง",
          "ตรวจสอบความลาดเอียงของท่อน้ำทิ้ง",
          "ตรวจสอบการเชื่อมต่อท่อและข้อต่อ",
          "ตรวจสอบการติดตั้งวาล์วปิด-เปิดน้ำ",
          "ถ่ายภาพบันทึกเส้นทางท่อก่อนปิดผนัง"
        ]
      },
      {
        "title": "งานระบบประปา - ทดสอบระบบ",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ทดสอบแรงดันน้ำในท่อ (Pressure Test 24 ชม.)",
          "ตรวจสอบการรั่วซึมของท่อและข้อต่อ",
          "ทดสอบการไหลของน้ำทิ้งและน้ำเสีย",
          "ตรวจสอบแรงดันน้ำที่จุดใช้งานทุกจุด",
          "จัดทำแผนผังประปา As-Built"
        ]
      },
      {
        "title": "งานสุขภัณฑ์ - เตรียมงาน",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบและรายการสุขภัณฑ์",
          "ตรวจสอบคุณภาพและความครบของสุขภัณฑ์",
          "ตรวจสอบตำแหน่งติดตั้งตามแบบ",
          "เตรียมอุปกรณ์ติดตั้ง: ซีลล็อค สายน้ำ",
          "ตรวจสอบความพร้อมของท่อประปาและท่อระบาย"
        ]
      },
      {
        "title": "งานสุขภัณฑ์ - ติดตั้ง",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการติดตั้งโถส้วมและฝักบัว",
          "ตรวจสอบการติดตั้งอ่างล้างหน้าและก๊อกน้ำ",
          "ตรวจสอบความมั่นคงของสุขภัณฑ์",
          "ตรวจสอบการต่อท่อน้ำและท่อระบาย",
          "ตรวจสอบการใช้ซีลล็อคป้องกันรั่วซึม"
        ]
      },
      {
        "title": "งานสุขภัณฑ์ - ทดสอบ",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ทดสอบการไหลของน้ำทุกจุด",
          "ทดสอบการชักโครกและระบบน้ำดี",
          "ตรวจสอบการรั่วซึมของสุขภัณฑ์",
          "ทดสอบแรงดันน้ำและอุณหภูมิน้ำร้อน",
          "ทำความสะอาดสุขภัณฑ์ทั้งหมด"
        ]
      },
      {
        "title": "งานระบายอากาศ",
        "phase": "ก่อนเริ่มงาน",
        "checkpoints": [
          "ตรวจสอบแบบระบบระบายอากาศ",
          "เตรียมอุปกรณ์: พัดลมระบายอากาศ ท่อดักท์",
          "ตรวจสอบตำแหน่งติดตั้งพัดลม",
          "วางแผนเส้นทางท่อระบายอากาศ",
          "ตรวจสอบแหล่งจ่ายไฟสำหรับพัดลม"
        ]
      },
      {
        "title": "งานระบายอากาศ",
        "phase": "ระหว่างทำงาน",
        "checkpoints": [
          "ตรวจสอบการติดตั้งพัดลมระบายอากาศ",
          "ตรวจสอบการต่อท่อดักท์",
          "ตรวจสอบการติดตั้งช่องระบายอากาศ",
          "ตรวจสอบการต่อสายไฟพัดลม",
          "ตรวจสอบทิศทางการระบายอากาศ"
        ]
      },
      {
        "title": "งานระบายอากาศ",
        "phase": "หลังเสร็จงาน",
        "checkpoints": [
          "ทดสอบการทำงานของพัดลมทุกตัว",
          "ตรวจสอบเสียงและความสั่นสะเทือน",
          "ทดสอบอัตราการไหลของอากาศ",
          "ตรวจสอบการรั่วของท่อดักท์",
          "ทำความสะอาดพัดลมและช่องระบายอากาศ"
        ]
      }
    ]
  }
]
